// namespace:
this.TY = this.TY || {};

TY.VERSION = "0";
TY.Debug = 0;



TY.data = [
	[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
	[1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
	[0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
	[0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
	[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
	[0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
	[0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
	[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
	[0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
	[0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
	[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
];


TY.morphConifg = {
	length: 10,
	1: 'Blink_L',
	2: 'Blink_R',
	3: 'Blink',
	4: 'BrowDown',
	5: 'BrowUp_L',
	6: 'BrowUp_R',
	7: 'BrowUp',
	8: 'MouthOpen',
	9: 'Grin_L',
	10: 'Grin_R'
};



// TY.morphConifg = {
// 	length: 30,
// 	1: '真面目',
// 	2: '困る',
// 	3: 'にこり',
// 	4: '怒り',
// 	5: '上',
// 	6: '下',
// 	7: 'まばたき',
// 	8: '笑い',
// 	9: 'ウィンク',
// 	10: 'ウィンク２',
// 	11: 'ウィンク右',
// 	12: 'ｳｨﾝｸ２右',
// 	13: 'はぅ',
// 	14: 'なごみ',
// 	15: 'びっくり',
// 	16: 'じと目',
// 	17: 'なぬ！',
// 	18: '瞳小',
// 	19: 'あ',
// 	20: 'い',
// 	21: 'う',
// 	22: 'お',
// 	23: '▲',
// 	24: '∧',
// 	25: 'ω',
// 	26: 'ω□',
// 	27: 'はんっ！',
// 	28: 'ぺろっ',
// 	29: 'えー',
// 	30: 'にやり'
// };






TY.inherit = function(ctor, superCtor) {
	ctor.superClass = superCtor;
	ctor.prototype = Object.create(superCtor.prototype);
	ctor.prototype.constructor = ctor;
};
TY.extend = function(origin, add) {
	// Don't do anything if add isn't an object
	if (!add || typeof add !== 'object')
		return origin;
	var keys = Object.keys(add);
	var i = keys.length;
	while (i--) {
		origin[keys[i]] = add[keys[i]];
	}
	return origin;
};
